app/controllers/carts_controller.rb

SELECT  `movies`.* FROM `movies`  WHERE `movies`.`id` = 1 LIMIT 1
---
  def show
    cart_ids = $redis.smembers current_user_cart
    @cart_movies = Movie.find(cart_ids)